index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-08-21 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Introduction to Abstract Algebra, Math 417, Fall 2023</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" title="Standard" href="css/worg.css" type="text/css">
<link rel="alternate stylesheet" title="Zenburn" href="css/worg-zenburn.css" type="text/css" />
<link rel="alternate stylesheet" title="Classic" href="css/worg-classic.css" type="text/css" />
<link rel="shortcut icon" href="https://math.illinois.edu/themes/custom/las_unit_theme/favicon-32x32.png" type="image/png" />
</head>
<body>
<main id="content">
<header>
<h1 class="title">Introduction to Abstract Algebra, Math 417, Fall 2023</h1>
</header>
<section id="outline-container-orgddc3e39" class="outline-2">
<h2 id="orgddc3e39">Basic information</h2>
<div class="outline-text-2" id="text-orgddc3e39">
<ul class="org-ul">
<li><b>Official designation:</b> MATH 417 Sections D13 and D14.</li>

<li><b>Lectures:</b> MWF 11:00&#x2013;11:50am in 169 Davenport Hall.</li>

<li><b>Instructor:</b> <a href="http://pascaleff.com">James Pascaleff</a>
<ul class="org-ul">
<li><b>Email:</b> <a href="mailto:jpascale@illinois.edu">jpascale@illinois.edu</a>; <b>Office:</b> <a href="https://www.google.com/maps/place/805+W+Pennsylvania+Ave,+Urbana,+IL+61801/">805 W. Pennsylvania</a>, Room 306; <b>Phone:</b> (217) 244-7277.</li>
<li><b>Office hours:</b> TBD.</li>
</ul></li>

<li><b>Course website:</b> <a href="https://pascaleff.github.io/417fa23/">pascaleff.github.io/417fa23/</a></li>

<li><b>Canvas website:</b> TBD.
<ul class="org-ul">
<li>Use this website to view grades and homework solutions.</li>
</ul></li>

<li><b>Prerequisites:</b> Either MATH 416 or one of ASRM 406, MATH 415 together with one of MATH 347, MATH 348, CS 374; or consent of instructor.</li>

<li><b>Textbook:</b> Frederick M. Goodman, <a href="http://homepage.divms.uiowa.edu/~goodman/algebrabook.dir/book.2.6.pdf"><i>Algebra: Abstract and Concrete</i></a> version 2.6. This e-book is available free of charge: <a href="http://homepage.divms.uiowa.edu/~goodman/algebrabook.dir/algebrabook.html">website for the book.</a></li>
</ul>
</div>
</section>

<section id="outline-container-org155b4e2" class="outline-2">
<h2 id="org155b4e2">Course outline</h2>
<div class="outline-text-2" id="text-org155b4e2">
<ul class="org-ul">
<li><b>Description:</b> This course is an introduction to the modern abstract
theory of algebra and algebraic structures. The primary focus is on
the theory of <b>groups</b>, which are &ldquo;abstract groups of composable
transformations;&rdquo; key examples include the symmetries of a geometric
figure, and the permutations of a set. Our focus is on constructing
groups, understanding their structure, and developing techniques for
classifying them.
At the end of the course we also begin the study of <b>rings and
fields</b>, which are &ldquo;abstract number systems&rdquo; in which there are
abstract versions of the four arithmetic operations: addition,
subtraction, multiplication, and (in the case of fields) division.</li>

<li><b>Lectures:</b> Lectures will be held in person. Written notes for the
lectures will be made available. Please see the links in the
schedule below.</li>

<li><b>Homework:</b> There will be 11 homework assignments whose due days
(usually Fridays) are listed in the schedule. Homework must be
submitted on paper in class. There is no homework due on weeks when
there is an exam.</li>

<li><b>Exams:</b> There will be two midterm exams and a final exam. The
midterm exams will be held in class on <b>Friday, September 29</b> and
<b>Friday, November 3</b>. The final exam date and time are TBD.</li>
</ul>
</div>
</section>

<section id="outline-container-org42df927" class="outline-2">
<h2 id="org42df927">Policies</h2>
<div class="outline-text-2" id="text-org42df927">
<ul class="org-ul">
<li><b>Assessment:</b> Grades will be based on homework (25%), two midterm
exams (22% each), and the final exam (31%). The two lowest homework
scores will be dropped. Grade cutoffs will never be stricter than
90% for an A- grade, 80% for a B-, and so on. Individual exams may
have grade cutoffs set more generously depending on their
difficulty.</li>

<li><b>Homework assignments</b> should be submitted <b>on paper in class</b> on
the due date. If you are unable to come to class, you may turn in
your homework to <b>James Pascaleff&rsquo;s mailbox in 250 Altgeld Hall.</b>
This mailbox will be checked at Noon on the due date, so you
should have your homework in the box by that time.</li>

<li><b>Late homework</b> will not be accepted, but the lowest two scores are
dropped, so you may miss one or two assignments without penalty.</li>

<li><b>Missed exams:</b> If you need to miss an exam (for reasons such as
illness, accident, or family crisis), please let the instructor know
as soon as possible, so that arrangements can be made.</li>

<li><b>Collaboration and Academic Integrity:</b> For homework assignments,
collaboration is permitted and expected, but you must write up your
solutions individually and understand them completely. On exams, no
collaboration is permitted.</li>

<li><b>Disability accommodations:</b> Students who require special
accommodations should contact the instructor as soon as
possible. Any accommodations on exams must be requested at least one
week in advance and will require a letter from DRES.</li>
</ul>
</div>
</section>

<section id="outline-container-org6dfbc78" class="outline-2">
<h2 id="org6dfbc78">Schedule</h2>
<div class="outline-text-2" id="text-org6dfbc78">
<ul class="org-ul">
<li><b>Week 1:</b> August 21&#x2013;25
<ul class="org-ul">
<li><a href="notes/417lecture01.pdf">Symmetries</a> [§§ 1.1&#x2013;1.4, 1.10]</li>
<li><a href="notes/417lecture02.pdf">Permutations</a> [§ 1.5]</li>
</ul></li>
<li><b>Week 2:</b> August 28&#x2013;September 1
<ul class="org-ul">
<li><a href="notes/417lecture03.pdf">Integer arithmetic</a> [§ 1.6]</li>
<li><a href="notes/417lecture04.pdf">Primes, modular arithmetic</a> [§§ 1.6&#x2013;1.7]</li>
<li><a href="hw/hw01.pdf">Homework 1</a> due Friday, September 1.</li>
</ul></li>
<li><b>Week 3:</b> September 4&#x2013;8
<ul class="org-ul">
<li><b>No Class</b> on Labor Day, Monday, September 4.</li>
<li><a href="notes/417lecture05.pdf">More modular arithmetic, basic group properties</a> [§§ 1.7, 2.1]</li>
<li><a href="hw/hw02.pdf">Homework 2</a> due Friday, September 4.</li>
</ul></li>
<li><b>Week 4:</b> September 11&#x2013;15                  
<ul class="org-ul">
<li><a href="notes/417lecture06.pdf">Subgroups, isomorphisms, Cayley&rsquo;s theorem</a> [§ 2.2]</li>
<li><a href="notes/417lecture07.pdf">Cyclic groups</a> [§ 2.2]</li>
<li><a href="hw/hw03.pdf">Homework 3</a> due Friday, September 15.</li>
</ul></li>
<li><b>Week 5:</b> September 18&#x2013;22
<ul class="org-ul">
<li><a href="notes/417lecture08.pdf">Subgroups of cyclic groups, dihedral groups</a> [§§ 2.2&#x2013;2.3]</li>
<li><a href="hw/hw04.pdf">Homework 4</a> due Friday, September 22.</li>
</ul></li>
<li><b>Week 6:</b> September 25&#x2013;29
<ul class="org-ul">
<li><a href="notes/417lecture09.pdf">Homomorphisms and kernels</a> [§ 2.4]</li>
<li><a href="notes/417lecture10.pdf">Cosets and Lagrange&rsquo;s theorem</a> [§ 2.5]</li>
<li><b>Exam 1:</b> Friday, September 29, covering weeks 1&#x2013;5.</li>
</ul></li>
<li><b>Week 7:</b> October 2&#x2013;6
<ul class="org-ul">
<li><a href="notes/417lecture11.pdf">Equivalence relations and partitions</a> [§ 2.6]</li>
<li><a href="notes/417lecture12.pdf">More on equivalence relations</a> [§ 2.6]</li>
<li><a href="hw/hw05.pdf">Homework 5</a> due Friday, October 6.</li>
</ul></li>
<li><b>Week 8:</b> October 9&#x2013;13
<ul class="org-ul">
<li><a href="notes/417lecture13.pdf">Quotient groups and homomorphisms</a> [§ 2.7]</li>
<li><a href="notes/417lecture14.pdf">Isomorphism theorems</a> [§ 2.7]</li>
<li><a href="hw/hw06.pdf">Homework 6</a> due Friday, October 13.</li>
</ul></li>
<li><b>Week 9:</b> October 16&#x2013;20
<ul class="org-ul">
<li><a href="notes/417lecture15.pdf">Diamond isomorphism, direct products of groups</a> [§§ 2.7, 3.1]</li>
<li><a href="notes/417lecture16.pdf">Semi-direct products</a> [§ 3.2]</li>
<li><a href="hw/hw07.pdf">Homework 7</a> due Friday, October 20.</li>
</ul></li>
<li><b>Week 10:</b> October 23&#x2013;27
<ul class="org-ul">
<li><a href="notes/417lecture17.pdf">Examples of semi-direct products, group actions</a> [§§ 3.2, 5.1]</li>
<li><a href="notes/417lecture18.pdf">Orbit-stabilizer theorem</a> [§ 5.1]</li>
<li><a href="hw/hw08.pdf">Homework 8</a> due.</li>
</ul></li>
<li><b>Week 11:</b> October 30&#x2013;November 3
<ul class="org-ul">
<li><a href="notes/417lecture19.pdf">Burnside/Cauchy-Frobenius lemma</a> [§ 5.2]</li>
<li><a href="notes/417lecture20.pdf">Class equation and applications</a> [§ 5.4]</li>
<li><b>Exam 2:</b> Friday, November 3, covering weeks 6&#x2013;10.</li>
</ul></li>
<li><b>Week 12:</b> November 6&#x2013;10
<ul class="org-ul">
<li><a href="notes/417lecture21.pdf">Sylow theorems and applications</a> [§ 5.4]</li>
<li><a href="notes/417lecture22.pdf">Proofs of Sylow theorems</a> [§ 5.4]</li>
<li><a href="hw/hw09.pdf">Homework 9</a> due Friday, November 10.</li>
</ul></li>
<li><b>Week 13:</b> November 13&#x2013;17
<ul class="org-ul">
<li><a href="notes/417lecture23.pdf">Introduction to rings and fields</a> [§§ 1.11, 6.1]</li>
<li><a href="notes/417lecture24.pdf">Polynomial rings over fields</a> [§ 1.8]</li>
<li><a href="hw/hw10.pdf">Homework 10</a> due Friday, November 17.</li>
</ul></li>
<li><b>Week 14:</b> November 20&#x2013;24
<ul class="org-ul">
<li><b>Fall Break, No Class.</b></li>
</ul></li>
<li><b>Week 15:</b> November 27&#x2013;December 1
<ul class="org-ul">
<li><a href="notes/417lecture25.pdf">Ring homomorphisms and ideals</a> [§ 6.2]</li>
<li><a href="notes/417lecture26.pdf">Quotient rings, homomorphism theorem for rings</a> [§ 6.3]</li>
</ul></li>
<li><b>Week 16:</b> December 4&#x2013;8
<ul class="org-ul">
<li><a href="notes/417lecture27.pdf">Maximal and prime ideals, integral domains</a> [§ 6.4]</li>
<li><a href="hw/hw11.pdf">Homework 11</a> due Wednesday December 6.</li>
</ul></li>
<li><b>Final Exam:</b> Date and time TBD.</li>
</ul>
</div>
</section>
</main>
<footer id="postamble" class="status">
This website was made with <a href="http://www.gnu.org/software/emacs/">Emacs</a> <a href="http://orgmode.org">Org-mode</a>. The css stylesheets are taken from <a href="http://orgmode.org/worg">orgmode.org/worg</a> and are licensed under the <a href="http://www.gnu.org/licenses/gpl.html">GNU General Public License v3</a> or later.
</footer>
</body>
</html>
